[
 {
   "name": "Armour of the Deep",
   "secret": "Secret of the Deep",
   "text": "You spend an hour underwater in the ocean. At the end of this hour your charisma and wisdom are both reduced by 4. You gain an additional 10 defence, and always count as wearing steel half-plate for the purposes of determining armour class and damage reduction."
 },
 {
   "name": "Awaken Plant",
   "secret": "Secret of Plants",
   "text": "You spend a week carving sacred symbols into a tree and imbuing them with your blood, giving it a part of your life-force. \n At the end of the week the tree turns into a treeant. You permanently lose one wound limit and your constitution is reduced by 2. \n Alternatively, you can awaken an area of smaller plants, creating a plantmind-amalgam."
 },
 {
   "name": "Avatar of Light",
   "secret": "Secret of Light",
   "text": "You spend a day praying. \n For the next week, you gain a flying speed of 80 ft, an extra attack and each of your attacks deals an extra 2d8 damage on a hit, and 1d8 damage on a miss. At the end of the week, or whenever the spell ends, you permanently lose 2 points of strength and constitution. Your wisdom is also reduced to 0. \n You can also activate this ability as a reaction to anything, but it only lasts a minute."
 },
 {
   "name": "Bring Back the Dead",
   "secret": "Secret of Life",
   "text": "You pray over a dead body for a day and a night. At the end of the prayer your wound limit is reduced by 1. Permanently. The creature returns to life. Their wound limit is also reduced by 1. Permanently."
 },
 {
   "name": "Call Rain",
   "secret": "Secret of Water",
   "text": "By spending an hour in meditation and spending 8 points you can call forth a rainstorm of epic significance. For 100 miles around you, it rains for weeks straight, flooding low lying areas and causing all outdoor areas to be difficult terrain. The rain and mist is so thick than no one can see further than 30 ft ahead of them. Any invocations you cast from the secret of water in this time deal double damage and cost 2 less."
 },
 {
   "name": "Call the Storm",
   "secret": "Secret of the Storm",
   "text": "You spend an hour and 4 points calling a lightning storm to your location. Until the end of your next long rest you can call down lightning. The 4 points spent here cannot be restored until you finish a downtime. \n To call lighting you can spend 2 points to deal 4d8 to every creature within 10 ft of a point you pick within 150 ft."
 },
 {
   "name": "Contact Daemon",
   "secret": "Secret of Chaos",
   "text": "You sacrifice a living creature and attempt to contact a daemon. The type of daemon contacted depends on the quality of the sacrifice. \n The daemon appears within a chalk circle you draw. Once the daemon appears you must bind it with a knowledge daemons check. If successful you can have it complete a single task. Any additional task beyond the first increases the DC, as do long or difficult tasks. \n If you fail the check by 5 the daemon instead attacks you."
 },
 {
   "name": "Create Undead",
   "secret": "Secret of Death",
   "text": "By taking an hour with a dead body you can grant it a semblance of life, creating a skeleton or zombie. This ritual requires you to carve your own flesh with a specially crafted you lose 1d3-1 defence permanently. If this defence loss would cause a wound the wound cannot be healed..dagger worth 1000 silver. Each time you cast this ceremony"
 },
 {
   "name": "Daemon Sight",
   "secret": "Secret of Daemons",
   "text": "You cut out one of your eyes (your choice) and replace it with a gem worth 10 gold. Whenever you see a daemon within 100 ft of you (or further, if it is a big daemon) you intuitively know that it is a daemon and it has a distinctive red glow. You gain the one eyed flaw. If you already have the one eyed flaw you are blinded and can only see daemons."
 },
 {
   "name": "Eyes from Beyond",
   "secret": "Secret of Stars",
   "text": "You cut out your own eyes. You are blinded. You gain the ability to see everything within 120 feet of you. You see the true forms of anything within that distance. You can see invisible or hiding creatures within that distance."
 },
 {
   "name": "Lichdom",
   "secret": "Secret of Death",
   "text": "You gather the blood of 13 children, who must die as a result of your bloodletting. You then spend a week creating a gem from their blood and 1000 gp worth of other materials. Once this is done you infuse the gem with the blood of a creature (normally yourself). The creature must make a DC 30 fortitude save. If it succeeds it becomes a lich. If it fails but beats a 20 it becomes a vampire. If it fails that too then it dies and can never be returned to life."
 },
 {
   "name": "Prayer of Healing",
   "secret": "Saint of Life",
   "text": "By taking an hour you can lend your strength to others. You can cure a number of wounds equal to your wisdom modifier times 2 (minor wounds take 1, major 2, mortal 3) and restore the defence of up to 8 targets within 60 feet of you. At the end of this ceremony you have -2 on all saves, attack rolls and ability check until your next downtime. If you cast this ceremony again before then the penalty increases to -4 and you then cannot use this ceremony until you complete a downtime."
 },
 {
   "name": "Prayer of Prosperity",
   "secret": "Saint of Plants",
   "text": "By spending a day and night fasting and meditating, you invigorate the lands around you. This increases crop yields by 20%, makes animals calmer and forests stronger for a year. For each location you cast this on beyond the first you take a wisdom penalty of 2, that lasts until the year is up or the spell ends for some other reason."
 },
 {
   "name": "Stone Building",
   "secret": "Secret of Stone",
   "text": "Casting Time: 1 hour.\n By spending 1 hour meditating on the nature and mutability of stone you can create walls of stone that slowly grow out of stone. Depending on how much you spend the amount and stability of the wall?s changes. The last option spends 2 points permanently, points spent to make a permanent structure cannot be recovered by any means.",
   "img": "https://cdn.discordapp.com/attachments/507858027215323136/509187902010556426/stonebuilding.PNG"
   },
 {
   "name": "Stormlord",
   "secret": "Secret of the Storm",
   "text": "You find a storm (or create one yourself). During the storm you mark yourself and call lightning to strike you. \n You must make 3 fortitude saves. \n The first is DC 15, on a fail you take 1d6 minor wounds, on a pass you take half the number rolled. \n The second is DC 20, on a fail you take 1d2 major wounds, on a pass you take one major wound. \n The third is DC 25, on a fail you take a mortal wound. \n If you are conscious after taking these wounds, then you can cast all spells from the secret of the storm at half cost and deal an extra 2 dice of damage. You are immune to lightning damage. These effects are permanent."
 },
 {
   "name": "Sword Dance",
   "secret": "Saint of Blades",
   "text": "By taking 10 minutes and performing an elaborate ritual you can grant your allies a magical effect on their weapons. Up to 10 creatures within range gain a +1 on attack rolls and damage rolls for an hour. Your defence is halved and cannot be restored above this amount until you finish a long rest."
 },
 {
   "name": "Voodoo",
   "secret": "Witchery",
   "text": "You mix the blood of a being you have gathered with dirt from a graveyard to make a clay doll. This ceremony drains 4 intelligence points and requires the killing of a small animal. When complete you can use the doll to target the creature with a spell with the range of touch."
 },
 {
   "name": "Wings",
   "secret": "Secret of Birds",
   "text": "You spend a day and a night focusing on the flight of birds. You permanently lose 2 strength and constitution and 4 points of your casting ability score. You gain wings. You gain a flying speed of 60ft."
 }
]