[
   {
      "name": "Incapacitated",
      "text": "An incapacitated creature cannot take any actions."
   },
   {
      "name": "Petrified",
      "text": "A petrified creature is turned to stone."
   },
   {
      "name": "Unconscious",
      "text": "An unconscious creature is incapacitated and prone. A hit against an unconscious creature is always a critical hit, deals double damage and ignores all the targets defence."
   },
   {
      "name": "Paralysed",
      "text": "A paralysed creature is incapacitated and prone. A hit against a paralysed creature is always a critical hit and ignores half the targets defence."
   },
   {
      "name": "Frightened",
      "text": "While frightened  a creature must move away from whatever frightened it, if it is within 60ft of the source of its fear. It has disadvantage on all attacks and ability checks while it can see or is otherwise aware of the source of its fear."
   },
   {
      "name": "Prone",
      "text": "If a creature is knocked prone, or falls prone willingly, its movement speed becomes 5 ft and attacks against it  from within 5 feet range have advantage. Ranged attacks against a prone creature have disadvantage."
   },
   {
      "name": "Poisoned",
      "text": "If a creature is poisoned or sickened it has its movement speed halved and the creature has disadvantage on all attack rolls and reflex saving throws."
   },
      {
      "name": "Sickened",
      "text": "If a creature is poisoned or sickened it has its movement speed halved and the creature has disadvantage on all attack rolls and reflex saving throws."
   },
   {
      "name": "Restrained",
      "text": "A restrained creature cannot move and has disadvantage on attack rolls, strength and dexterity checks and reflex saves. Attacks against a restrained creature have advantage."
   },
   {
      "name": "Grappled",
      "text": [
         "A grappled creature cannot move and has disadvantage on attacks. When attacking a creature that is grappled the target gains +3 to armour class unless the attacking creature is the one performing the grapple.",
         "An attack against a grappled creature can critically fail, hitting the creature doing the grapple on a critical failure.",
         "To cast a spell while grappled a creature must make a DC 12 concentration check each round they cast. To escape a grapple the creature must pass a contested strength or dexterity check against the grappling creatures strength check."
      ]
   },
   {
      "name": "Blinded",
      "text": "A blinded or blind creature cannot see. It automatically fails any perception checks or any other checks relying on sight. Its movement speed is halved while blinded."
   },
   {
      "name": "Stunned",
      "text": "A stunned creature can only take the Take Cover or Full Attack actions on its turn. The creature can only make a single attack at disadvantage and its movement speed is reduced to 5ft."
   },
   {
      "name": "Slowed",
      "text": "A slowed creature has its movement speed reduced by half. It has disadvantage on reflex saves. The creature can only make half the number of attacks it usually can, and any spells take twice as long as normal to cast. The creature cannot take any action outside of its turn."
   },
   {
      "name": "Fascinated",
      "text": "A fascinated creature cannot look away from whatever is fascinating them."
   }
]