[
   {
      "name": "Alarm",
      "castingtime": "1 minute",
      "text": "You ward a campsite, warning you if someone attacks. Until the next dawn, or you leave the area, if any person, monster, or large beast enters within 60ft of your campfire you are immediately alerted."
   },
   {
      "name": "Bonfire",
      "castingtime": "10 minutes",
      "text": "You create a bonfire out of thin air that lasts for 8 hours. While you are within 60 feet of this bonfire all invocations from the secret of fire cost one less point of casting ability score."
   },
   {
      "name": "Cast the Bones",
      "castingtime": "10 minutes",
      "text": "You search into the future, gaining some insight into the future. If you attempt to cast this ritual more than once per downtime you have an increased chance of incorrect results.\n\t\tThe insight gained from this ritual could be a phrase or a single word. Or just a feeling of wrongness or rightness. You can attempt to ask the bones a specific question but there is a 50% change there will be no answer and the casting of the ritual is wasted."
   },
   {
      "name": "Clear the Skies",
      "castingtime": "10 minutes",
      "text": [
         "You attempt to influence the weather around you. Make a check using your casting ability score.",
         "The change happens over an hour. The weather changes at half the speed for the rest of the day if changing back to the original weather. You can only cast this once per day.",
         "Example Weathers include Cyclone, Bad storm, Storm, Mild Storm , Heavy Rain, Rain, Drizzle, Heavy Cloud, Light Clouds, Clear"
      ],
      "table": [
         "15\tChange weather by one step",
         "20\tChange weather by two steps",
         "25\tChange weather by three steps"
      ]
   },
   {
      "name": "Create Trickle",
      "castingtime": "1 hour",
      "text": "You attempt to pull water forth from the ground. Depending on the terrain you can get water for 0 to 8 people, as determined by your GM and random chance."
   },
   {
      "name": "Forest Sense",
      "castingtime": "10 Minutes",
      "text": "For the next hour you have advantage on tracking or perception checks as long as you are touching a living plant that is touching a system of plants that are connected in some way, for example a forest or grassland."
   },
   {
      "name": "Gentle Repose",
      "castingtime": "1 hour",
      "text": "You perform a ritual over a dead body to keep it from decomposing or becoming an undead. As part of this ritual you must place a coin on each eye. The body then is protected for a week."
   },
   {
      "name": "Healing Chant",
      "castingtime": "1 hour.",
      "text": "During a short rest you can fortify your companions at the cost of healing yourself. You cannot spend any recovery dice, but your companions can each spend one recovery dice for free"
   },
   {
      "name": "Light",
      "castingtime": "1 Minute",
      "text": "You touch an object. For the next hour, or until you dismiss it, the object shines brightly, shining light 60 ft around it."
   },
   {
      "name": "Mage Armour",
      "castingtime": "1 hour",
      "text": "One target you touch gains a +2 bonus to armour class until the end of your next long rest. You can only grant this bonus to one creature at a time. If you cast this ritual before another casting of mage armour wears off the original casting is cancelled."
   },
   {
      "name": "Detect Magic",
      "castingtime": "10 minutes",
      "text": "You can see faint auras around items, locations, or people affected by magic for an hour. By concentrating on the aura for 10 minutes you can determine the strength and type of spell. More complex spells may require a spellcraft or arcana check. You can learn the origin of the spell, what secret it belongs to (if any) and its rough power level."
   },
   {
      "name": "Moonlight Dancing",
      "castingtime": "8 hours",
      "text": "Can only be cast on a full moon. Instead of long resting you can find a place of natural power, such as standing stones, a waterfall, or similar, and perform a ritual that involves naked dancing in the moonlight. Every participant in this ritual gains a +1 to every 2d10 roll for the next week."
   },
   {
      "name": "Shroud",
      "castingtime": "10 minutes",
      "text": "Target you touch may add your intelligence modifier at the time of casting to all stealth checks for an hour as shadows hide and conceal them."
   },
   {
      "name": "Stone Skin",
      "castingtime": "10 minutes",
      "text": "For the next hour your skin is hard and stone like. Your movement speed is reduced by 10 ft and you have resistance to slashing and piercing damage."
   },
   {
      "name": "Read Magic",
      "castingtime": "1 minute",
      "text": "You spend some time preparing, focusing on magical writing or runes you can touch. At the end of the minute you magically gain an understanding as to their function."
   }
]